todos/app/controllers/api/todos_controller.rb

    def create
        @todo = Todo.new(todo_params)
        if @todo.save
---
INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "do asdfasdf"], ["body", "asdfsfdgf"], ["created_at", "2022-04-14 19:39:04.325781"], ["updated_at", "2022-04-14 19:39:04.325781"]]

    def update
        @todo = Todo.find(params[:id])
        if @todo && @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2022-04-14 21:47:10.065748"], ["id", 24]]

    def destroy
        @todo = Todo.find(params[:id])
        @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 28]]